# StructuralSectionLAngle Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionLAngle Methods
StructuralSectionLAngle Class See Also
---
The StructuralSectionLAngle type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from StructuralSection.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBoundarySize | Returns size of the section boundary.  (Inherited from StructuralSection.) |
| GetEnumerator | (Inherited from StructuralSection.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace